{
  "users": [
    {
      "id": 1,
      "username": "jose",
      "password": "1234",
      "role": "writer"
    },
    {
      "id": 2,
      "username": "marta",
      "password": "abcd",
      "role": "editor"
    },
    {
      "id": 3,
      "username": "luis",
      "password": "password123",
      "role": "writer"
    },
    {
      "id": 4,
      "username": "ana",
      "password": "ana1234",
      "role": "editor"
    },
    {
      "id": 5,
      "username": "pablo",
      "password": "pablo5678",
      "role": "writer"
    }
  ],
  
    "articles": [
      {
        "id": "1",
        "title": "La inteligencia artificial revoluciona la medicina",
        "subtitle": "Un avance tecnológico que cambiará la forma en que tratamos las enfermedades.",
        "date": "2025-01-22",
        "section": "Tecnología",
        "image": "https://vinbrain.net/public/uploads/1blog/ai-cho-cham-soc-suc-khoe/ai-in-healthcare-everything-you-need-to-know-1024x638.png",
        "body": "La inteligencia artificial (IA) está siendo implementada en múltiples campos de la medicina, mejorando diagnósticos y tratamientos. Los algoritmos de IA ahora pueden detectar patrones de enfermedades con mayor precisión que los médicos humanos...",
        "author": "Carlos Pérez",
        "status": "published",
        "editorid": "editor_001",
        "highlight": false
      },
      {
        "id": "2",
        "title": "Nuevo descubrimiento sobre los agujeros negros",
        "subtitle": "Un equipo internacional de científicos ha realizado un avance significativo en el estudio de los agujeros negros.",
        "date": "2025-01-20",
        "section": "Ciencia",
        "image": "https://static.euronews.com/articles/stories/07/88/71/42/1200x675_cmsv2_ba7a2c87-36be-5768-a315-c7338040d429-7887142.jpg",
        "body": "Los astrónomos han logrado captar imágenes más detalladas de los agujeros negros y han identificado nuevas características que podrían cambiar nuestra comprensión del espacio-tiempo. Este descubrimiento abre nuevas posibilidades para la investigación en física avanzada...",
        "author": "Laura Sánchez",
        "status": "revisable",
        "editorid": "editor_002",
        "highlight": false
      },
      {
        "id": "3",
        "title": "El cambio climático afecta a los ecosistemas marinos",
        "subtitle": "Los océanos del mundo enfrentan una crisis debido a los efectos del cambio climático.",
        "date": "2025-01-18",
        "section": "Medio Ambiente",
        "image": "https://earth.org/wp-content/uploads/2022/04/Untitled-design-2022-04-21T102359.778-1200x900.jpg",
        "body": "Los ecosistemas marinos, como los arrecifes de coral, están siendo gravemente afectados por el aumento de las temperaturas oceánicas. Los científicos advierten sobre la posible extinción de diversas especies si no se toman medidas inmediatas...",
        "author": "Ricardo Gómez",
        "status": "draft",
        "editorid": "editor_003",
        "highlight": false
      },
      {
        "id": "4",
        "title": "El avance de la tecnología en los vehículos autónomos",
        "subtitle": "Las pruebas de autos sin conductor siguen avanzando y podrían cambiar la movilidad urbana.",
        "date": "2025-01-15",
        "section": "Tecnología",
        "image": "https://cdn.aarp.net/content/dam/aarp/auto/2018/10/1140-self-driving-car.jpg",
        "body": "El desarrollo de vehículos autónomos está alcanzando nuevos niveles de eficiencia y seguridad. Las principales compañías tecnológicas están liderando las pruebas de autos sin conductor, que prometen reducir accidentes y mejorar el tráfico...",
        "author": "Sofía Rodríguez",
        "status": "published",
        "editorid": "editor_004",
        "highlight": false
      },
      {
        "id": "5",
        "title": "Científicos descubren una nueva especie de dinosaurio",
        "subtitle": "Un hallazgo paleontológico sorprendente en el desierto de Atacama.",
        "date": "2025-01-10",
        "section": "Cultura",
        "image": "https://imagenes.elpais.com/resizer/v2/TE6HK5DJZNHSHM6R7OIHJTUCWE.jpg?auth=153560d3b54eb8bf8da85e3075122a10d111559f14715567f71952f9805cf802&width=1960&height=1103&smart=true",
        "body": "Un equipo de paleontólogos ha encontrado una nueva especie de dinosaurio en el desierto de Atacama. La criatura, que vivió hace 75 millones de años, podría cambiar la forma en que entendemos la evolución de los dinosaurios en la región...",
        "author": "Juan Martínez",
        "status": "published",
        "editorid": "editor_005",
        "highlight": false
      },
      {
        "id": "6",
        "title": "La influencia de las redes sociales en la política moderna",
        "subtitle": "Las plataformas digitales han transformado la forma en que se lleva a cabo la política global.",
        "date": "2025-01-05",
        "section": "Politica",
        "image": "https://concepto.de/wp-content/uploads/2014/08/redes-sociales-1-e1551307320533.jpg",
        "body": "Las redes sociales juegan un papel cada vez más relevante en la política. Desde las elecciones hasta los movimientos sociales, estas plataformas permiten una comunicación directa con el electorado, pero también presentan desafíos en términos de desinformación...",
        "author": "María López",
        "status": "published",
        "editorid": "editor_006",
        "highlight": false
      },
      {
        "id": "7",
        "title": "La exploración espacial: nuevos horizontes en Marte",
        "subtitle": "Las misiones a Marte abren nuevas posibilidades para el futuro de la humanidad en el espacio.",
        "date": "2025-01-03",
        "section": "Ciencia",
        "image": "https://www.alten.ch/wp-content/uploads/sites/10/2021/04/Perseverance-1.jpg",
        "body": "Los avances en la exploración de Marte están acelerando. Los últimos rovers han enviado imágenes y datos detallados del planeta rojo, abriendo la posibilidad de futuras misiones tripuladas que podrían establecer bases permanentes en el planeta...",
        "author": "Elena González",
        "status": "published",
        "editorid": "editor_007",
        "highlight": false
      },
      {
        "id": "8",
        "title": "Impacto de la inteligencia emocional en el entorno laboral",
        "subtitle": "Cómo la inteligencia emocional puede mejorar el rendimiento y bienestar en las empresas.",
        "date": "2025-01-01",
        "section": "Negocios",
        "image": "https://epaouydin3q.exactdn.com/wp-content/uploads/2024/03/Emotional-Intelligence.jpg?strip=all&lossy=1&fit=1024%2C585&ssl=1",
        "body": "Los líderes empresariales están comenzando a reconocer la importancia de la inteligencia emocional en el entorno laboral. Desarrollar habilidades como la empatía y el autocontrol puede mejorar la productividad y las relaciones interpersonales dentro de las organizaciones...",
        "author": "Felipe Díaz",
        "status": "published",
        "editorid": "editor_008",
        "highlight": true
      },
      {
        "id": "9",
        "title": "La crisis del agua: un problema global urgente",
        "subtitle": "El acceso al agua potable es cada vez más limitado en muchas partes del mundo.",
        "date": "2024-12-28",
        "section": "Medio Ambiente",
        "image": "https://siwi.org/wp-content/uploads/2021/07/why-water_topics-present-at-launch_water-scarcity.jpg",
        "body": "En diversas regiones del planeta, el acceso al agua potable se está convirtiendo en una crisis sin precedentes. El cambio climático y la sobreexplotación de los recursos hídricos están llevando a millones de personas a vivir sin acceso adecuado a agua limpia...",
        "author": "Antonio Ruiz",
        "status": "draft",
        "editorid": "editor_009",
        "highlight": false
      },
      {
        "id": "10",
        "title": "El futuro de las energías renovables en el mundo",
        "subtitle": "Las energías renovables están cambiando la matriz energética global.",
        "date": "2024-12-22",
        "section": "Economía",
        "image": "https://news.ftcpublications.com/core/wp-content/uploads/The-Future-of-Renewable-Energy-Sources.png",
        "body": "Las energías renovables, como la solar y la eólica, están ganando terreno frente a los combustibles fósiles. Expertos prevén que, en las próximas décadas, el 50% de la energía global provendrá de fuentes renovables, impulsando la transición hacia una economía más sostenible...",
        "author": "Ana Torres",
        "status": "published",
        "editorid": "editor_010",
        "highlight": true
      },
      {
        "id": "11",
        "title": "La inteligencia artificial y el arte: una nueva frontera creativa",
        "subtitle": "La IA está abriendo nuevas posibilidades en el mundo del arte digital.",
        "date": "2025-01-20",
        "section": "Cultura",
        "image": "https://www.digitalartsonline.co.uk/cmsdata/features/3484221/ai_painting_hero_2.jpg",
        "body": "Los artistas están utilizando inteligencia artificial para crear obras que desafían nuestra comprensión tradicional del arte. Herramientas como DALL·E permiten crear imágenes impresionantes de cero, fusionando la tecnología con la creatividad humana...",
        "author": "Lucía García",
        "status": "published",
        "editorid": "editor_011",
        "highlight": true
      },
      {
        "id": "12",
        "title": "El impacto de la pandemia en la salud mental",
        "subtitle": "Los efectos psicológicos de la pandemia siguen siendo una preocupación global.",
        "date": "2025-01-15",
        "section": "Salud",
        "image": "https://cdn.pixabay.com/photo/2020/03/19/13/22/mental-health-4941226_960_720.jpg",
        "body": "Estudios recientes muestran que la pandemia ha tenido un impacto profundo en la salud mental de las personas. Desde el aumento de la ansiedad hasta la depresión, los efectos a largo plazo siguen siendo una preocupación creciente para los profesionales de la salud...",
        "author": "Carlos Jiménez",
        "status": "revisable",
        "editorid": "editor_012",
        "highlight": false
      },
      {
        "id": "13",
        "title": "Las energías limpias y su rol en la economía global",
        "subtitle": "Las energías limpias se están convirtiendo en una parte fundamental del crecimiento económico mundial.",
        "date": "2025-01-25",
        "section": "Economía",
        "image": "https://www.energy.gov/sites/prod/files/styles/borealis_photo_hero/public/2020/11/f73/clean_energy_jobs_hero.jpg",
        "body": "Las inversiones en energías renovables no solo están reduciendo la huella de carbono global, sino que también están creando nuevos empleos en la industria energética. Este cambio está impulsando el crecimiento económico en muchos países...",
        "author": "Esteban Díaz",
        "status": "published",
        "editorid": "editor_013",
        "highlight": false
      },
      {
        "id": "14",
        "title": "Revolución digital en el sector bancario",
        "subtitle": "Las tecnologías digitales están transformando la forma en que los bancos ofrecen sus servicios.",
        "date": "2025-01-22",
        "section": "Negocios",
        "image": "https://www.finextra.com/finextra-images/2021/12/133226/images/flexible-banking-1024x576.jpg",
        "body": "La adopción de la inteligencia artificial, la blockchain y los pagos móviles están mejorando la eficiencia y seguridad en los servicios bancarios, llevando a una mayor personalización en la experiencia del cliente...",
        "author": "Marta López",
        "status": "revisable",
        "editorid": "editor_014",
        "highlight": true
      },
      {
        "id": "15",
        "title": "El auge del teletrabajo y su impacto en las ciudades",
        "subtitle": "El trabajo remoto ha transformado la estructura urbana y las dinámicas laborales.",
        "date": "2025-01-19",
        "section": "Sociedad",
        "image": "https://cdn.pixabay.com/photo/2020/10/15/11/21/home-office-5652342_960_720.jpg",
        "body": "El teletrabajo se ha consolidado como una opción permanente para muchos profesionales. Esto está llevando a una redistribución de la población hacia áreas suburbanas y rurales, con consecuencias en la infraestructura urbana...",
        "author": "Andrés Gómez",
        "status": "published",
        "editorid": "editor_015",
        "highlight": false
      },
      {
        "id": "16",
        "title": "La nueva era del transporte aéreo eléctrico",
        "subtitle": "Los aviones eléctricos podrían revolucionar la industria de la aviación.",
        "date": "2025-01-17",
        "section": "Tecnología",
        "image": "https://www.electricaircraft.com/wp-content/uploads/2021/02/electric-plane.jpg",
        "body": "La tecnología de aviones eléctricos está avanzando rápidamente, prometiendo vuelos más sostenibles, rápidos y económicos. Empresas están invirtiendo fuertemente en este sector, lo que podría cambiar la aviación comercial para siempre...",
        "author": "David Torres",
        "status": "draft",
        "editorid": "editor_016",
        "highlight": false
      },
      {
        "id": "17",
        "title": "La importancia de la biodiversidad en el futuro de la humanidad",
        "subtitle": "Proteger la biodiversidad es clave para el bienestar del planeta y sus habitantes.",
        "date": "2025-01-14",
        "section": "Medio Ambiente",
        "image": "https://www.treehugger.com/thmb/FPSw1v7DRRv3oTTp9T6p_61kl1I=/1000x750/filters:no_upscale():max_bytes(150000):strip_icc()/Biodiversity-GettyImages-1280964668-1-4e3ff33b01d143fd890b5d812a9c9bfa.jpg",
        "body": "La biodiversidad no solo es crucial para la salud de los ecosistemas, sino también para el bienestar humano. Cada vez más científicos advierten que la pérdida de especies puede tener consecuencias catastróficas para la humanidad...",
        "author": "Pedro Martínez",
        "status": "revisable",
        "editorid": "editor_017",
        "highlight": false
      },
      {
        "id": "18",
        "title": "La evolución del comercio electrónico y las compras online",
        "subtitle": "El comercio electrónico sigue siendo una de las tendencias de crecimiento más rápidas a nivel global.",
        "date": "2025-01-11",
        "section": "Negocios",
        "image": "https://upload.wikimedia.org/wikipedia/commons/4/4b/E-commerce_symbol_logo.svg",
        "body": "El comercio electrónico está avanzando a pasos agigantados, con nuevas tecnologías que mejoran la experiencia de compra. Las empresas están incorporando realidad aumentada, inteligencia artificial y pagos automatizados para mejorar la experiencia del cliente...",
        "author": "Carla Ramírez",
        "status": "published",
        "editorid": "editor_018",
        "highlight": true
      },
      {
        "id": "19",
        "title": "El impacto de la robótica en la industria manufacturera",
        "subtitle": "La automatización está cambiando la producción en la industria manufacturera.",
        "date": "2025-01-08",
        "section": "Industria",
        "image": "https://www.manufacturing.net/sites/default/files/styles/hero_image/public/2019-03/robots.jpg",
        "body": "La robótica está permitiendo a las fábricas producir más rápido y con mayor precisión. Las empresas que adoptan estas tecnologías están logrando una ventaja competitiva importante, lo que podría cambiar la industria para siempre...",
        "author": "Laura Torres",
        "status": "revisable",
        "editorid": "editor_019",
        "highlight": false
      },
      {
        "id": "20",
        "title": "La agricultura sostenible y su futuro",
        "subtitle": "Nuevas técnicas agrícolas están ayudando a producir alimentos de manera más eficiente y ecológica.",
        "date": "2025-01-04",
        "section": "Medio Ambiente",
        "image": "https://www.nationalgeographic.com/content/dam/environment/2021/09/22/sustainable-agriculture/01_22.jpg",
        "body": "La agricultura sostenible busca reducir los impactos negativos en el medio ambiente. Técnicas como la agricultura regenerativa están demostrando ser clave para garantizar un futuro más saludable para el planeta y sus habitantes...",
        "author": "Antonio Pérez",
        "status": "published",
        "editorid": "editor_020",
        "highlight": true
      },
      {
        "id": "21",
        "title": "El impacto de la inteligencia artificial en la educación",
        "subtitle": "La IA está transformando las metodologías de enseñanza y aprendizaje.",
        "date": "2025-01-27",
        "section": "Educación",
        "image": "https://www.weforum.org/agenda/2020/07/ai-transform-education/",
        "body": "La inteligencia artificial está permitiendo una personalización en la educación como nunca antes. Herramientas basadas en IA permiten que los estudiantes aprendan a su propio ritmo y con contenidos adaptados a sus necesidades...",
        "author": "Elena Rodríguez",
        "status": "published",
        "editorid": "editor_021",
        "highlight": false
      },
      {
        "id": "22",
        "title": "El auge de la impresión 3D en la fabricación industrial",
        "subtitle": "La impresión 3D está revolucionando el sector manufacturero, reduciendo costos y tiempos de producción.",
        "date": "2025-01-23",
        "section": "Industria",
        "image": "https://www.themanufacturer.com/wp-content/uploads/2021/09/3D-printing-manufacturing-2021.jpg",
        "body": "La impresión 3D está permitiendo la fabricación de componentes complejos a bajo costo y con mayor rapidez. Esto está transformando el diseño de productos y la cadena de suministro en industrias clave como la automotriz y la aeronáutica...",
        "author": "Marco Gómez",
        "status": "revisable",
        "editorid": "editor_022",
        "highlight": false
      },
      {
        "id": "23",
        "title": "La lucha contra las fake news en las redes sociales",
        "subtitle": "Las plataformas digitales se enfrentan al desafío de frenar la desinformación.",
        "date": "2025-01-19",
        "section": "Política",
        "image": "https://media.sproutsocial.com/uploads/2020/04/05/30/53/fake-news.jpg",
        "body": "Las redes sociales son un canal importante para la información, pero también son un terreno fértil para la desinformación. Las plataformas están implementando nuevas estrategias para verificar la veracidad de las noticias y evitar su propagación...",
        "author": "Ricardo Fernández",
        "status": "draft",
        "editorid": "editor_023",
        "highlight": true
      },
      {
        "id": "24",
        "title": "La revolución de la automoción eléctrica",
        "subtitle": "El futuro de los vehículos eléctricos está más cerca que nunca.",
        "date": "2025-01-17",
        "section": "Tecnología",
        "image": "https://www.electricvehiclewiki.com/wp-content/uploads/2021/02/electric-vehicle.jpg",
        "body": "La industria automotriz está apostando fuerte por los vehículos eléctricos, con modelos de diferentes marcas que ya están dominando el mercado. Las innovaciones en baterías están impulsando la adopción masiva de estos vehículos...",
        "author": "Carlos Sánchez",
        "status": "revisable",
        "editorid": "editor_024",
        "highlight": false
      },
      {
        "id": "25",
        "title": "Desarrollo de nuevas terapias contra el cáncer",
        "subtitle": "Los avances científicos están ofreciendo nuevas esperanzas en la lucha contra el cáncer.",
        "date": "2025-01-12",
        "section": "Ciencia",
        "image": "https://www.cancer.gov/about-cancer/treatment/drugs/images/cancer-treatment.jpg",
        "body": "Investigadores están desarrollando terapias innovadoras que permiten un tratamiento más efectivo y menos invasivo contra el cáncer. Las terapias génicas y las vacunas contra el cáncer están mostrando resultados prometedores...",
        "author": "Laura González",
        "status": "published",
        "editorid": "editor_025",
        "highlight": false
      },
      {
        "id": "26",
        "title": "El futuro de la energía nuclear en el siglo XXI",
        "subtitle": "La energía nuclear sigue siendo una fuente controvertida pero esencial para la generación de electricidad.",
        "date": "2025-01-09",
        "section": "Economía",
        "image": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Nuclear_power_plant.jpg",
        "body": "A pesar de la controversia que rodea a la energía nuclear, sigue siendo una de las fuentes de energía más eficientes y de bajo costo para la producción de electricidad. Nuevas tecnologías podrían hacerla más segura y sostenible...",
        "author": "José Martínez",
        "status": "published",
        "editorid": "editor_026",
        "highlight": true
      },
      {
        "id": "27",
        "title": "La evolución de la ciberseguridad en un mundo conectado",
        "subtitle": "Con la creciente digitalización, la ciberseguridad se convierte en una prioridad para las empresas.",
        "date": "2025-01-07",
        "section": "Tecnología",
        "image": "https://www.pwc.com/gx/en/services/consulting/cyber-security.jpg",
        "body": "Las amenazas cibernéticas están en constante evolución, lo que ha llevado a una mayor inversión en ciberseguridad. Las empresas deben implementar estrategias avanzadas para proteger sus datos y sistemas frente a ciberataques...",
        "author": "Patricia López",
        "status": "revisable",
        "editorid": "editor_027",
        "highlight": false
      },
      {
        "id": "28",
        "title": "Impacto del turismo sostenible en el medio ambiente",
        "subtitle": "El turismo responsable puede ayudar a preservar los destinos naturales del mundo.",
        "date": "2025-01-02",
        "section": "Sociedad",
        "image": "https://www.travelandleisure.com/thmb/3lI-MFn2tn-kqp8lr6V1_MJv5RE4=/1200x630/filters:no_upscale()/sustainable-tourism-header-2000.jpg",
        "body": "El turismo sostenible busca equilibrar el desarrollo económico con la conservación del medio ambiente. Destinos turísticos están implementando prácticas responsables para reducir su huella ecológica y proteger los ecosistemas...",
        "author": "Ana Pérez",
        "status": "published",
        "editorid": "editor_028",
        "highlight": false
      },
      {
        "id": "29",
        "title": "La inteligencia artificial en la medicina personalizada",
        "subtitle": "La medicina personalizada basada en IA está mejorando la precisión de los tratamientos médicos.",
        "date": "2025-01-01",
        "section": "Ciencia",
        "image": "https://www.medicalnewstoday.com/articles/medical-ai.jpg",
        "body": "Los avances en inteligencia artificial están permitiendo un enfoque más personalizado en la medicina. Los algoritmos pueden analizar los datos genéticos de los pacientes para diseñar tratamientos específicos que mejoren los resultados...",
        "author": "María Fernández",
        "status": "draft",
        "editorid": "editor_029",
        "highlight": true
      },
      {
        "id": "30",
        "title": "El auge de las energías marinas como fuente de energía renovable",
        "subtitle": "Las energías marinas están demostrando ser una opción viable para complementar las energías renovables tradicionales.",
        "date": "2025-01-03",
        "section": "Economía",
        "image": "https://www.sciencedirect.com/science/article/pii/S1364032112003951",
        "body": "Las energías marinas, como la energía undimotriz y las olas, están ganando terreno como fuentes alternativas para la producción de electricidad. Esta tecnología promete aumentar la capacidad de generación de energías limpias...",
        "author": "Laura Rodríguez",
        "status": "published",
        "editorid": "editor_030",
        "highlight": false
      },
      {
        "id": "31",
        "title": "La creciente popularidad de las criptomonedas en los mercados financieros",
        "subtitle": "Las criptomonedas continúan ganando terreno como una alternativa a los sistemas bancarios tradicionales.",
        "date": "2025-01-10",
        "section": "Economía",
        "image": "https://cryptopotato.com/wp-content/uploads/2021/07/cryptocurrencies.jpg",
        "body": "Las criptomonedas, lideradas por Bitcoin y Ethereum, están siendo cada vez más aceptadas por inversores y empresas. Aunque los gobiernos siguen debatiendo su regulación, las criptos han demostrado ser una inversión viable para muchos...",
        "author": "David Torres",
        "status": "published",
        "editorid": "editor_031",
        "highlight": false
      },
      {
        "id": "32",
        "title": "El futuro de la inteligencia artificial en el arte",
        "subtitle": "La IA está desafiando las nociones tradicionales de creatividad en el arte y la música.",
        "date": "2025-01-11",
        "section": "Cultura",
        "image": "https://www.artsy.net/article/artsy-editorial-ai-art",
        "body": "La inteligencia artificial está permitiendo que se creen obras de arte innovadoras. Desde pinturas hasta composiciones musicales, la IA ofrece nuevas posibilidades para artistas, pero también plantea preguntas sobre la autoría y el valor del arte...",
        "author": "Ana Martínez",
        "status": "revisable",
        "editorid": "editor_032",
        "highlight": true
      },
      {
        "id": "33",
        "title": "La revolución del trabajo remoto en la post-pandemia",
        "subtitle": "El trabajo remoto ha llegado para quedarse, transformando el mercado laboral global.",
        "date": "2025-01-13",
        "section": "Negocios",
        "image": "https://www.flexjobs.com/blog/post/remote-work-from-home-jobs/",
        "body": "El trabajo remoto se ha convertido en la norma en muchas industrias. Empresas de todo el mundo están implementando políticas flexibles que permiten a sus empleados trabajar desde casa, lo que ha mejorado la productividad y la calidad de vida...",
        "author": "Luis González",
        "status": "published",
        "editorid": "editor_033",
        "highlight": false
      },
      {
        "id": "34",
        "title": "El crecimiento de la movilidad urbana sostenible",
        "subtitle": "Las ciudades están adoptando soluciones de transporte sostenible para reducir su huella de carbono.",
        "date": "2025-01-16",
        "section": "Urbanismo",
        "image": "https://media.urbanet.info/wp-content/uploads/2019/12/urban-mobility.jpg",
        "body": "Las ciudades están invirtiendo en infraestructura para fomentar el uso de bicicletas, transporte público eléctrico y vehículos compartidos, con el objetivo de reducir la contaminación y mejorar la calidad del aire...",
        "author": "Carla Rodríguez",
        "status": "published",
        "editorid": "editor_034",
        "highlight": false
      },
      {
        "id": "35",
        "title": "Las neurociencias y su impacto en la salud mental",
        "subtitle": "Avances en neurociencia están cambiando el tratamiento de los trastornos mentales.",
        "date": "2025-01-18",
        "section": "Salud",
        "image": "https://www.psychologytoday.com/us/blog/words-of-wellness/202201/the-future-of-mental-health-treatment",
        "body": "Investigaciones en neurociencia están proporcionando nuevas perspectivas sobre los trastornos mentales. Técnicas como la estimulación cerebral profunda y terapias basadas en neurotecnología están demostrando eficacia para tratar enfermedades como la depresión y la ansiedad...",
        "author": "José Martínez",
        "status": "published",
        "editorid": "editor_035",
        "highlight": true
      },
      {
        "id": "36",
        "title": "El auge de los deportes electrónicos en la cultura popular",
        "subtitle": "Los deportes electrónicos han ganado una enorme popularidad, atrayendo audiencias globales.",
        "date": "2025-01-20",
        "section": "Deportes",
        "image": "https://cdn1.dotesports.com/wp-content/uploads/2020/02/05141450/esports-3.jpg",
        "body": "Los deportes electrónicos, o eSports, se han convertido en una industria multimillonaria. Torneos de videojuegos están siendo transmitidos a millones de personas, convirtiendo a los jugadores en celebridades y creando una cultura global en torno a estos eventos...",
        "author": "Raúl Pérez",
        "status": "published",
        "editorid": "editor_036",
        "highlight": false
      },
      {
        "id": "37",
        "title": "La digitalización de la educación superior",
        "subtitle": "Las universidades están adoptando tecnologías digitales para ofrecer una educación más accesible.",
        "date": "2025-01-21",
        "section": "Educación",
        "image": "https://www.digitaltrends.com/wp-content/uploads/2021/04/digital-education.jpg",
        "body": "Las plataformas de aprendizaje en línea están permitiendo a estudiantes de todo el mundo acceder a programas de educación superior. Esto está abriendo nuevas oportunidades para aquellos que no tienen acceso a universidades tradicionales...",
        "author": "Carlos Ruiz",
        "status": "revisable",
        "editorid": "editor_037",
        "highlight": false
      },
      {
        "id": "38",
        "title": "Los avances en la biotecnología agrícola",
        "subtitle": "La biotecnología está mejorando los cultivos y ayudando a resolver problemas de seguridad alimentaria.",
        "date": "2025-01-25",
        "section": "Ciencia",
        "image": "https://www.nature.com/articles/biotechnology-agriculture.jpg",
        "body": "Los avances en biotecnología están permitiendo la creación de cultivos más resistentes a plagas, enfermedades y condiciones climáticas extremas. Esto podría ser clave para garantizar la seguridad alimentaria en el futuro...",
        "author": "María López",
        "status": "published",
        "editorid": "editor_038",
        "highlight": true
      },
      {
        "id": "39",
        "title": "El impacto de la realidad aumentada en el entretenimiento",
        "subtitle": "La realidad aumentada está ofreciendo nuevas formas de interactuar con el entretenimiento digital.",
        "date": "2025-01-22",
        "section": "Tecnología",
        "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d1/AR_game_iphone_2019.jpg/800px-AR_game_iphone_2019.jpg",
        "body": "La realidad aumentada está transformando la forma en que interactuamos con los medios de entretenimiento. Desde juegos hasta experiencias de cine inmersivo, esta tecnología está permitiendo experiencias más interactivas...",
        "author": "Elena Martínez",
        "status": "published",
        "editorid": "editor_039",
        "highlight": false
      },
      {
        "id": "40",
        "title": "El uso de drones en la agricultura moderna",
        "subtitle": "Los drones están ayudando a los agricultores a optimizar el uso de recursos y mejorar la cosecha.",
        "date": "2025-01-24",
        "section": "Deportes",
        "image": "https://www.smithsonianmag.com/wp-content/uploads/2021/03/03/drone-agriculture.jpg",
        "body": "Los drones están siendo utilizados para monitorear los cultivos y aplicar fertilizantes de manera más precisa. Esta tecnología está mejorando la eficiencia en la agricultura, permitiendo a los agricultores producir más con menos recursos...",
        "author": "José Pérez",
        "status": "revisable",
        "editorid": "editor_040",
        "highlight": false
      }
    ],
    "subscribers": [
      {
        "email": "carlos@email.com"
      }
    ]
  }
  

