{
    "users": [
      {
        "id": "1",
        "username": "jose",
        "password": "1234",
        "role": "writer"
      },
      {
        "id": "2",
        "username": "marta",
        "password": "abcd",
        "role": "editor"
      },
      {
        "id": "3",
        "username": "luis",
        "password": "password123",
        "role": "writer"
      },
      {
        "id": "4",
        "username": "ana",
        "password": "ana1234",
        "role": "editor"
      },
      {
        "id": "5",
        "username": "pablo",
        "password": "pablo5678",
        "role": "writer"
      }
    ],
    "articles": [
    {
      "id": "1",
    "title": "La inteligencia artificial revoluciona la medicina",
    "subtitle": "Un avance tecnológico que cambiará la forma en que tratamos las enfermedades.",
    "date": "2025-01-22",
    "section": "Tecnología",
    "image": "https://vinbrain.net/public/uploads/1blog/ai-cho-cham-soc-suc-khoe/ai-in-healthcare-everything-you-need-to-know-1024x638.png",
    "body": "La inteligencia artificial (IA) está siendo implementada en múltiples campos de la medicina, mejorando diagnósticos y tratamientos. Los algoritmos de IA ahora pueden detectar patrones de enfermedades con mayor precisión que los médicos humanos...",
    "author": "Carlos Pérez",
    "status": "published",
    "editorid": "editor_001"
  },
  {
    "id": "2",
    "title": "Nuevo descubrimiento sobre los agujeros negros",
    "subtitle": "Un equipo internacional de científicos ha realizado un avance significativo en el estudio de los agujeros negros.",
    "date": "2025-01-20",
    "section": "Ciencia",
    "image": "https://static.euronews.com/articles/stories/07/88/71/42/1200x675_cmsv2_ba7a2c87-36be-5768-a315-c7338040d429-7887142.jpg",
    "body": "Los astrónomos han logrado captar imágenes más detalladas de los agujeros negros y han identificado nuevas características que podrían cambiar nuestra comprensión del espacio-tiempo. Este descubrimiento abre nuevas posibilidades para la investigación en física avanzada...",
    "author": "Laura Sánchez",
    "status": "revisable",
    "editorid": "editor_002"
  },
  {
    "id": "3",
    "title": "El cambio climático afecta a los ecosistemas marinos",
    "subtitle": "Los océanos del mundo enfrentan una crisis debido a los efectos del cambio climático.",
    "date": "2025-01-18",
    "section": "Medio Ambiente",
    "image": "https://earth.org/wp-content/uploads/2022/04/Untitled-design-2022-04-21T102359.778-1200x900.jpg",
    "body": "Los ecosistemas marinos, como los arrecifes de coral, están siendo gravemente afectados por el aumento de las temperaturas oceánicas. Los científicos advierten sobre la posible extinción de diversas especies si no se toman medidas inmediatas...",
    "author": "Ricardo Gómez",
    "status": "draft",
    "editorid": "editor_003"
  },
  {
    "id": "4",
    "title": "El avance de la tecnología en los vehículos autónomos",
    "subtitle": "Las pruebas de autos sin conductor siguen avanzando y podrían cambiar la movilidad urbana.",
    "date": "2025-01-15",
    "section": "Tecnología",
    "image": "https://cdn.aarp.net/content/dam/aarp/auto/2018/10/1140-self-driving-car.jpg",
    "body": "El desarrollo de vehículos autónomos está alcanzando nuevos niveles de eficiencia y seguridad. Las principales compañías tecnológicas están liderando las pruebas de autos sin conductor, que prometen reducir accidentes y mejorar el tráfico...",
    "author": "Sofía Rodríguez",
    "status": "published",
    "editorid": "editor_004"
  },
  {
    "id": "5",
    "title": "Científicos descubren una nueva especie de dinosaurio",
    "subtitle": "Un hallazgo paleontológico sorprendente en el desierto de Atacama.",
    "date": "2025-01-10",
    "section": "Cultura",
    "image": "https://imagenes.elpais.com/resizer/v2/TE6HK5DJZNHSHM6R7OIHJTUCWE.jpg?auth=153560d3b54eb8bf8da85e3075122a10d111559f14715567f71952f9805cf802&width=1960&height=1103&smart=true",
    "body": "Un equipo de paleontólogos ha encontrado una nueva especie de dinosaurio en el desierto de Atacama. La criatura, que vivió hace 75 millones de años, podría cambiar la forma en que entendemos la evolución de los dinosaurios en la región...",
    "author": "Juan Martínez",
    "status": "revisable",
    "editorid": "editor_005"
  },
  {
    "id": "6",
    "title": "La influencia de las redes sociales en la política moderna",
    "subtitle": "Las plataformas digitales han transformado la forma en que se lleva a cabo la política global.",
    "date": "2025-01-05",
    "section": "Sociedad",
    "image": "https://concepto.de/wp-content/uploads/2014/08/redes-sociales-1-e1551307320533.jpg",
    "body": "Las redes sociales juegan un papel cada vez más relevante en la política. Desde las elecciones hasta los movimientos sociales, estas plataformas permiten una comunicación directa con el electorado, pero también presentan desafíos en términos de desinformación...",
    "author": "María López",
    "status": "draft",
    "editorid": "editor_006"
  },
  {
    "id": "7",
    "title": "La exploración espacial: nuevos horizontes en Marte",
    "subtitle": "Las misiones a Marte abren nuevas posibilidades para el futuro de la humanidad en el espacio.",
    "date": "2025-01-03",
    "section": "Ciencia",
    "image": "https://www.alten.ch/wp-content/uploads/sites/10/2021/04/Perseverance-1.jpg",
    "body": "Los avances en la exploración de Marte están acelerando. Los últimos rovers han enviado imágenes y datos detallados del planeta rojo, abriendo la posibilidad de futuras misiones tripuladas que podrían establecer bases permanentes en el planeta...",
    "author": "Elena González",
    "status": "published",
    "editorid": "editor_007"
  },
  {
    "id": "8",
    "title": "Impacto de la inteligencia emocional en el entorno laboral",
    "subtitle": "Cómo la inteligencia emocional puede mejorar el rendimiento y bienestar en las empresas.",
    "date": "2025-01-01",
    "section": "Negocios",
    "image": "https://epaouydin3q.exactdn.com/wp-content/uploads/2024/03/Emotional-Intelligence.jpg?strip=all&lossy=1&fit=1024%2C585&ssl=1",
    "body": "Los líderes empresariales están comenzando a reconocer la importancia de la inteligencia emocional en el entorno laboral. Desarrollar habilidades como la empatía y el autocontrol puede mejorar la productividad y las relaciones interpersonales dentro de las organizaciones...",
    "author": "Felipe Díaz",
    "status": "revisable",
    "editorid": "editor_008"
  },
  {
    "id": "9",
    "title": "La crisis del agua: un problema global urgente",
    "subtitle": "El acceso al agua potable es cada vez más limitado en muchas partes del mundo.",
    "date": "2024-12-28",
    "section": "Medio Ambiente",
    "image": "https://siwi.org/wp-content/uploads/2021/07/why-water_topics-present-at-launch_water-scarcity.jpg",
    "body": "En diversas regiones del planeta, el acceso al agua potable se está convirtiendo en una crisis sin precedentes. El cambio climático y la sobreexplotación de los recursos hídricos están llevando a millones de personas a vivir sin acceso adecuado a agua limpia...",
    "author": "Antonio Ruiz",
    "status": "draft",
    "editorid": "editor_009"
  },
  {
    "id": "10",
    "title": "El futuro de las energías renovables en el mundo",
    "subtitle": "Las energías renovables están cambiando la matriz energética global.",
    "date": "2024-12-22",
    "section": "Economía",
    "image": "https://news.ftcpublications.com/core/wp-content/uploads/The-Future-of-Renewable-Energy-Sources.png",
    "body": "Las energías renovables, como la solar y la eólica, están ganando terreno frente a los combustibles fósiles. Expertos prevén que, en las próximas décadas, el 50% de la energía global provendrá de fuentes renovables, impulsando la transición hacia una economía más sostenible...",
    "author": "Ana Torres",
    "status": "published",
    "editorid": "editor_010"
  }
]
 
}

